conditional-auth-sample/src/main/resources/sample1/configs/create-tenant-pickup-management.xml

<!--
  ~ Copyright (c) 2018, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.
  ~
  ~ WSO2 Inc. licenses this file to you under the Apache License,
  ~ Version 2.0 (the "License"); you may not use this file except
  ~ in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied.  See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://services.mgt.tenant.carbon.wso2.org"
                  xmlns:xsd="http://beans.common.stratos.carbon.wso2.org/xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:addTenant>
            <!--Optional:-->
            <ser:tenantInfoBean>
                <!--Optional:-->
                <xsd:active>true</xsd:active>
                <!--Optional:-->
                <xsd:admin>cameron</xsd:admin>
                <!--Optional:-->
                <xsd:adminPassword>cameron123</xsd:adminPassword>
                <!--Optional:-->
                <xsd:email>cameron@management.pickup.com</xsd:email>
                <!--Optional:-->
                <xsd:firstname>Pickup</xsd:firstname>
                <!--Optional:-->
                <xsd:lastname>Management</xsd:lastname>
                <xsd:tenantDomain>management.pickup.com</xsd:tenantDomain>
                <!--Optional:-->
                <xsd:usagePlan>DEMO</xsd:usagePlan>
            </ser:tenantInfoBean>
        </ser:addTenant>
    </soapenv:Body>
</soapenv:Envelope>
